In [1]:
import pandas as pd
import numpy as np

In [2]:
group=['x','y','z']

data1=pd.DataFrame({
    'group':[group[x] for x in np.random.randint(0,len(group),10)],
    'age':np.random.randint(15,50,10)
})

data2=pd.DataFrame({
    'group':[group[x] for x in np.random.randint(0,len(group),10)],
    'salary':np.random.randint(5,50,10)
})

data3=pd.DataFrame({
    'group':[group[x] for x in np.random.randint(0,len(group),10)],
    'age':np.random.randint(15,50,10),
    'salary':np.random.randint(5,50,10)
})

In [3]:
data1

  group  age
0     y   45
1     x   36
2     y   17
3     x   25
4     z   42
5     x   34
6     x   26
7     y   37
8     x   44
9     x   49

In [4]:
data2

  group  salary
0     x      18
1     z      22
2     z      47
3     z      33
4     x      41
5     z      10
6     y      42
7     x      30
8     z       7
9     z      30

In [6]:
data3

  group  age  salary
0     z   19      17
1     y   29      11
2     x   18      48
3     x   22       6
4     x   49      11
5     x   32      46
6     z   36      20
7     y   32      12
8     y   40      20
9     y   20      38

In [7]:
# 一对一

pd.merge(data1,data2)

   group  age  salary
0      y   45      42
1      y   17      42
2      y   37      42
3      x   36      18
4      x   36      41
5      x   36      30
6      x   25      18
7      x   25      41
8      x   25      30
9      x   34      18
10     x   34      41
11     x   34      30
12     x   26      18
13     x   26      41
14     x   26      30
15     x   44      18
16     x   44      41
17     x   44      30
18     x   49      18
19     x   49      41
20     x   49      30
21     z   42      22
22     z   42      47
23     z   42      33
24     z   42      10
25     z   42       7
26     z   42      30

In [8]:
# 多对一

pd.merge(data3,data2,on='group')

   group  age  salary_x  salary_y
0      z   19        17        22
1      z   19        17        47
2      z   19        17        33
3      z   19        17        10
4      z   19        17         7
5      z   19        17        30
6      z   36        20        22
7      z   36        20        47
8      z   36        20        33
9      z   36        20        10
10     z   36        20         7
11     z   36        20        30
12     y   29        11        42
13     y   32        12        42
14     y   40        20        42
15     y   20        38        42
16     x   18        48        18
17     x   18        48        41
18     x   18        48        30
19     x   22         6        18
20     x   22         6        41
21     x   22         6        30
22     x   49        11        18
23     x   49        11        41
24     x   49        11        30
25     x   32        46        18
26     x   32        46        41
27     x   32        46        30

In [9]:
# 多对多
pd.merge(data3,data2)

Empty DataFrame
Columns: [group, age, salary]
Index: []

In [10]:
# 连接键类型，解决没有公共列问题

pd.merge(data3,data2,left_on='age',right_on='salary')

  group_x  age  salary_x group_y  salary_y
0       x   18        48       x        18
1       x   22         6       z        22

In [11]:
# 纵向连接
pd.concat([data1,data2])

  group   age  salary
0     y  45.0     NaN
1     x  36.0     NaN
2     y  17.0     NaN
3     x  25.0     NaN
4     z  42.0     NaN
5     x  34.0     NaN
6     x  26.0     NaN
7     y  37.0     NaN
8     x  44.0     NaN
9     x  49.0     NaN
0     x   NaN    18.0
1     z   NaN    22.0
2     z   NaN    47.0
3     z   NaN    33.0
4     x   NaN    41.0
5     z   NaN    10.0
6     y   NaN    42.0
7     x   NaN    30.0
8     z   NaN     7.0
9     z   NaN    30.0